dhzl84/ESP8266-Smart-Home/src/main.cpp
      if (myThermostat.getActualState()) { /* heating */
        myDisplay.drawHeating;
      }
    }
  }
  #ifdef CFG_DEBUG_DISPLAY_VERSION
  myDisplay.setTextAlignment(TEXT_ALIGN_LEFT);
  myDisplay.setFont(Roboto_Condensed_16);
  myDisplay.drawString(0, drawTargetTempYOffset, String(VERSION));
  myDisplay.drawString(0, 48, String("IPv4: " + (WiFi.localIP().toString()).substring(((WiFi.localIP().toString()).lastIndexOf(".") + 1), (WiFi.localIP().toString()).length())));
  #endif

  myDisplay.display();
}

void MQTT_MAIN(void) {
  if (myMqttClient.connected() != true) {
    if (TimeReached(mqttReconnectTime)) {  /* try reconnect to MQTT broker after mqttReconnectTime expired */
        SetNextTimeInterval(mqttReconnectTime, mqttReconnectInterval); /* reset interval */
        MQTT_CONNECT();
        mqttPubState();
    } else {
      /* just wait */
    }
  } else {  /* check if there is new data to publish and shift PubCycle if data is published on event, else publish every PubCycleInterval */
    if ( TimeReached(mqttPubCycleTime) || myThermostat.getNewData() ) {
        SetNextTimeInterval(mqttPubCycleTime, myConfig.mqttPubCycle * minutesToMillisecondsFactor);
        mqttPubState();
        myThermostat.resetNewData();
    }
    if (myMqttHelper.getTriggerDiscovery()) {
      homeAssistantDiscovery();  /* make HA discover/update necessary devices at runtime e.g. after name change */
      myMqttHelper.setTriggerDiscovery(false);
    }
    if (myMqttHelper.getTriggerUndiscover()) {
      homeAssistantUndiscover();  /* make HA undiscover entities */
      myMqttHelper.setTriggerUndiscover(false);
    }
  }
}

void HANDLE_HTTP_UPDATE(void) {
  if (fetchUpdate == true) {
    /* publish and loop here before fetching the update */
    myMqttClient.publish(myMqttHelper.getTopicUpdateFirmwareAccepted(), String(false), false, MQTT_QOS); /* publish accepted update with value false to reset the switch in Home Assistant */
    myMqttClient.loop();

    DRAW_DISPLAY_MAIN();
    fetchUpdate = false;
    #ifdef CFG_DEBUG
    Serial.println("Remote update started");
    #endif
    WiFiClient client;
    t_httpUpdate_return ret = ESPhttpUpdate.update(client, myConfig.updServer, FW);

    switch (ret) {
    case HTTP_UPDATE_FAILED:
      #ifdef CFG_DEBUG
      Serial.printf("HTTP_UPDATE_FAILD Error (%d): %s \n", ESPhttpUpdate.getLastError(), ESPhttpUpdate.getLastErrorString().c_str());
      #endif
      break;

    case HTTP_UPDATE_NO_UPDATES:
      #ifdef CFG_DEBUG
      Serial.println("HTTP_UPDATE_NO_UPDATES");
      #endif
      break;

    case HTTP_UPDATE_OK:
      #ifdef CFG_DEBUG
      Serial.println("HTTP_UPDATE_OK");
      #endif
      break;
    }
  }
}

void SPIFFS_MAIN(void) {
  /* force SPIFFS write with restart, this is necessary for SW reconfiguration in certain cases like changing the input method or changing the decives name */

  if (requestSaveToSpiffsWithRestart == true) {
    if (saveConfiguration(myConfig)) {
      requestSaveToSpiffsWithRestart = false;
      requestSaveToSpiffs = false;  /* reset non reset request as well */
      systemRestartRequest = true;
      } else {
      /* write failed, retry next loop */
    }
  }
  if (requestSaveToSpiffs == true) {
    if (saveConfiguration(myConfig)) {
      requestSaveToSpiffs = false;
      } else {
      /* write failed, retry next loop */
    }
  }
  /* avoid extensive writing to SPIFFS, therefore check if the target temperature didn't change for a certain time before writing. */
  if ( (myThermostat.getNewCalib()) || (myThermostat.getTargetTemperature() != myConfig.tTemp) || (myThermostat.getThermostatHysteresis() != myConfig.tHyst) || (myThermostat.getThermostatMode() != myConfig.mode) ) {
    SPIFFS_REFERENCE_TIME = millis();  // ToDo: handle wrap around
    myConfig.tTemp  = myThermostat.getTargetTemperature();
    myConfig.calibF = myThermostat.getSensorCalibFactor();
    myConfig.calibO = myThermostat.getSensorCalibOffset();
    myConfig.tHyst  = myThermostat.getThermostatHysteresis();
    myConfig.mode   = myThermostat.getThermostatMode();
    myThermostat.resetNewCalib();
    SPIFFS_WRITTEN = false;
    #ifdef CFG_DEBUG
    Serial.println("SPIFFS to be stored after debounce time: " + String(SPIFFS_WRITE_DEBOUNCE));
    #endif /* CFG_DEBUG */
  } else {
    /* no spiffs data changed this loop */
  }
  if (SPIFFS_WRITTEN == true) {
    /* do nothing, last change was already stored in SPIFFS */
  } else { /* latest change not stored in SPIFFS */
    if (SPIFFS_REFERENCE_TIME + SPIFFS_WRITE_DEBOUNCE < millis()) { /* check debounce */
      /* debounce expired -> write */
      if (saveConfiguration(myConfig)) {
        SPIFFS_WRITTEN = true;
      } else {
        /* SPIFFS not written, retry next loop */
        #ifdef CFG_DEBUG
        Serial.println("SPIFFS write failed");
        #endif /* CFG_DEBUG */
      }
    } else {
      /* debounce SPIFFS write */
    }
  }
}
/*===================================================================================================================*/
/* callback, interrupt, timer, other functions */
/*===================================================================================================================*/

void ICACHE_RAM_ATTR onOffButton(void) {
  /* debouncing routine for encoder switch */
  if (TimeReached(onOffButtonDebounceTime)) {
    SetNextTimeInterval(onOffButtonDebounceTime, buttonDebounceInterval);
    myThermostat.toggleThermostatMode();
  }
}

/* Push Buttons */
void ICACHE_RAM_ATTR upButton(void) {
  /* debouncing routine for push button */
  if (TimeReached(upButtonDebounceTime)) {
    SetNextTimeInterval(upButtonDebounceTime, buttonDebounceInterval);
    myThermostat.increaseTargetTemperature(tempStep);
  }
}

void ICACHE_RAM_ATTR downButton(void) {
  /* debouncing routine for push button */
  if (TimeReached(downButtonDebounceTime)) {
    SetNextTimeInterval(downButtonDebounceTime, buttonDebounceInterval);
    myThermostat.decreaseTargetTemperature(tempStep);
  }
}
/* Rotary Encoder */
void ICACHE_RAM_ATTR updateEncoder(void) {
  int16_t MSB = digitalRead(PHYS_INPUT_1_PIN);
  int16_t LSB = digitalRead(PHYS_INPUT_2_PIN);

