dhzl84/ESP8266-Smart-Home/src/main.cpp
  int16_t encoded = (MSB << 1) |LSB;  /* converting the 2 pin value to single number */

  int16_t sum  = (lastEncoded << 2) | encoded; /* adding it to the previous encoded value */

  if (sum == 0b1101 || sum == 0b0100 || sum == 0b0010 || sum == 0b1011) { /* gray patterns for rotation to right */
    rotaryEncoderDirectionInts += rotRight; /* count rotation interrupts to left and right, this shall make the encoder routine more robust against bouncing */
  }
  if (sum == 0b1110 || sum == 0b0111 || sum == 0b0001 || sum == 0b1000) { /* gray patterns for rotation to left */
    rotaryEncoderDirectionInts += rotLeft;
  }

  if (encoded == 0b11) { /* if the encoder is in an end position, evaluate the number of interrupts to left/right. simple majority wins */
    #ifdef CFG_DEBUG_ENCODER
    Serial.println("Rotary encoder interrupts: " + String(rotaryEncoderDirectionInts));
    #endif

    if (rotaryEncoderDirectionInts > rotRight) { /* if there was a higher amount of interrupts to the right, consider the encoder was turned to the right */
      myThermostat.increaseTargetTemperature(tempStep);
    } else if (rotaryEncoderDirectionInts < rotLeft) { /* if there was a higher amount of interrupts to the left, consider the encoder was turned to the left */
      myThermostat.decreaseTargetTemperature(tempStep);
    } else {
      /* do nothing here, left/right interrupts have occurred with same amount -> should never happen */
    }
    rotaryEncoderDirectionInts = rotInit; /* reset interrupt count for next sequence */
  }
  lastEncoded = encoded; /* store this value for next time */
}

/* Home Assistant discovery on connect; used to define entities in HA to communicate with*/
void homeAssistantDiscovery(void) {
  myMqttClient.publish(myMqttHelper.getTopicHassDiscoveryClimate(),                   myMqttHelper.buildHassDiscoveryClimate(String(myConfig.name), String(FW)),         true, MQTT_QOS);    // make HA discover the climate component
  myMqttClient.publish(myMqttHelper.getTopicHassDiscoverySensor(sTemp),               myMqttHelper.buildHassDiscoverySensor(String(myConfig.name), sTemp),               true, MQTT_QOS);    // make HA discover the temperature sensor
  myMqttClient.publish(myMqttHelper.getTopicHassDiscoverySensor(sHum),                myMqttHelper.buildHassDiscoverySensor(String(myConfig.name), sHum),                true, MQTT_QOS);    // make HA discover the humidity sensor
  myMqttClient.publish(myMqttHelper.getTopicHassDiscoverySwitch(swRestart),           myMqttHelper.buildHassDiscoverySwitch(String(myConfig.name), swRestart),           true, MQTT_QOS);    // make HA discover the reset switch
  myMqttClient.publish(myMqttHelper.getTopicHassDiscoverySwitch(swUpdate),            myMqttHelper.buildHassDiscoverySwitch(String(myConfig.name), swUpdate),            true, MQTT_QOS);    // make HA discover the update switch
}

/* Make Home Assistant forget the discovered entities in demand */
void homeAssistantUndiscover(void) {
  myMqttClient.publish(myMqttHelper.getTopicHassDiscoveryClimate(),                   String(""),         true, MQTT_QOS);    // make HA forget the climate component
  myMqttClient.publish(myMqttHelper.getTopicHassDiscoverySensor(sTemp),               String(""),         true, MQTT_QOS);    // make HA forget the temperature sensor
  myMqttClient.publish(myMqttHelper.getTopicHassDiscoverySensor(sHum),                String(""),         true, MQTT_QOS);    // make HA forget the humidity sensor
  myMqttClient.publish(myMqttHelper.getTopicHassDiscoverySwitch(swRestart),           String(""),         true, MQTT_QOS);    // make HA forget the reset switch
  myMqttClient.publish(myMqttHelper.getTopicHassDiscoverySwitch(swUpdate),            String(""),         true, MQTT_QOS);    // make HA forget the update switch
}

/* publish state topic in JSON format */
void mqttPubState(void) {
  String payload = myMqttHelper.buildStateJSON( /* build JSON payload */\
      String(myConfig.name), \
      String(intToFloat(myThermostat.getFilteredTemperature()), 1), \
      String(intToFloat(myThermostat.getFilteredHumidity()), 1), \
      String(intToFloat(myThermostat.getThermostatHysteresis()), 1), \
      String(boolToStringOnOff(myThermostat.getActualState())), \
      String(intToFloat(myThermostat.getTargetTemperature()), 1), \
      String(myThermostat.getSensorError()), \
      String(boolToStringHeatOff(myThermostat.getThermostatMode())), \
      String(myThermostat.getSensorCalibFactor()), \
      String(intToFloat(myThermostat.getSensorCalibOffset()), 0), \
      WiFi.localIP().toString(), \
      String(FW) );

  myMqttClient.publish( \
    myMqttHelper.getTopicData(), /* get topic */ \
    payload, \
    true, /* retain */ \
    MQTT_QOS); /* QoS */
}

void handleWebServerClient(void) {
  String IPaddress = WiFi.localIP().toString();
  float rssiInPercent = WiFi.RSSI();
  rssiInPercent = isnan(rssiInPercent) ? -100.0 : min(max(2 * (rssiInPercent + 100.0), 0.0), 100.0);

  String webpage = "<!DOCTYPE html> <html>\n";
  /* HEAD */
  webpage +="<head><meta name=\"viewport\" content=\"width=device-width, initial-scale=1.0, user-scalable=no\">\n";
  webpage +="<title> "+ String(myConfig.name) + "</title>\n";
  webpage +="<style>html { font-family: Helvetica; font-size: 16px; display: inline-block; margin: 0px auto; text-align: left;}\n";
  webpage +="body {background-color: #202226; color: #A0A2A8}\n";
  webpage +="p {color: #2686c1; margin-bottom: 10px;}\n";
  webpage +="table {color: #A0A2A8;}\n";
  webpage +="</style>\n";
  webpage +="</head>\n";
  /* BODY */
  webpage +="<body>\n";
  webpage +="<p><b>System information</b></p>";
  webpage +="<table>";

  /*= KEY ======================================||= VALUE ================================*/
  webpageTableAppend2Cols(String("Name"),              String(myConfig.name));
  webpageTableAppend2Cols(String("Chip ID"),           String(ESP.getChipId(), HEX));
  webpageTableAppend2Cols(String("IPv4"),              IPaddress);
  webpageTableAppend2Cols(String("FW version"),        String(FW));
  webpageTableAppend2Cols(String("Arduino Core"),      ESP.getCoreVersion());
  webpageTableAppend2Cols(String("Reset Reason"),      ESP.getResetReason());
  webpageTableAppend2Cols(String("Time since Reset"),  String(millisFormatted()));
  webpageTableAppend2Cols(String("Flash Size"),        String(ESP.getFlashChipRealSize()));
  webpageTableAppend2Cols(String("Sketch Size"),       String(ESP.getSketchSize()));
  webpageTableAppend2Cols(String("Free for Sketch"),   String(ESP.getFreeSketchSpace()));
  webpageTableAppend2Cols(String("Free Heap"),         String(ESP.getFreeHeap()));
  webpageTableAppend2Cols(String("Vcc"),               String(ESP.getVcc()/1000.0));
  webpageTableAppend2Cols(String("WiFi Status"),       wifiStatusToString(WiFi.status()));
  webpageTableAppend2Cols(String("WiFi Strength"),     String(rssiInPercent, 0) + " %");
  webpageTableAppend2Cols(String("WiFi Connects"),     String(WiFiConnectCounter));
  webpageTableAppend2Cols(String("MQTT Status"),       String((myMqttClient.connected()) == true ? "connected" : "disconnected"));
  webpageTableAppend2Cols(String("MQTT Connects"),     String(MQTTConnectCounter));
  webpage +="</table>";
  /* Change Input Method */
  webpage +="<p><b>Change Input Method</b></p>";
  webpage +="<form method='POST' autocomplete='off'>";

  if (myConfig.inputMethod == cPUSH_BUTTONS) {
    webpage +="<select name='InputMethod'> <option value='0'>Rotary Encoder </option> <option value='1' selected> Push Buttons </option> </select>&nbsp;<input type='submit' value='Submit'>";
  } else {
    webpage +="<select name='InputMethod'> <option value='0' selected> Rotary Encoder </option> <option value='1'> Push Buttons </option> </select>&nbsp;<input type='submit' value='Submit'>";
  }
  webpage +="</form>";
  /* Change sensor */
  webpage +="<p><b>Change Sensor</b></p>";
  webpage +="<form method='POST' autocomplete='off'>";
  webpage +="<select name='Sensor'> ";
  if (myConfig.sensor == cDHT22) {  /* select currently configured input method */
  webpage +="<option value='0' selected >DHT22 </option> <option value='1'> BME280 </option>";
  } else {
  webpage +="<option value='0'>DHT22 </option> <option value='1' selected > BME280 </option>";
  }
  webpage +="</select>&nbsp;<input type='submit' value='Submit'>";
  webpage +="</form>";

  webpage +="<p><b>Change Display Brightness ( 0 .. 255)</b></p>";
  webpage +="<form method='POST' autocomplete='off'>";
  webpage +="<input type='number' name='dispBrightn' min='1' max='255' value="+ String(myConfig.dispBrightn) + ">&nbsp;<input type='submit' value='Submit'>";
  webpage +="</form>";

  webpage +="<p><b>Change Sensor Calibration Offset (-50 .. 50 | Resolution 0.1 deg Celsius)</b></p>";
  webpage +="<form method='POST' autocomplete='off'>";
  webpage +="<input type='number' name='calibO' min='-50' max='+50' value="+ String(myConfig.calibO) + ">&nbsp;<input type='submit' value='Submit'>";
  webpage +="</form>";

  webpage +="<p><b>Change Sensor Calibration Factor (1 .. 200 %)</b></p>";
  webpage +="<form method='POST' autocomplete='off'>";
  webpage +="<input type='number' name='calibF' min='1' max='200' value="+ String(myConfig.calibF) + ">&nbsp;<input type='submit' value='Submit'>";
  webpage +="</form>";
  /* Command Line */
  webpage +="<p><b>Command Line</b></p>";
  webpage +="<form method='POST' autocomplete='off'>";
  webpage +="<input type='text' name='cmd' value='key:value'>&nbsp;<input type='submit' value='Submit'>";
  webpage +="</form>";
  webpage +="<p><b>Commands</b></p>";
  webpage +="<table style='font-size: 12px'>";
  webpageTableAppend4Cols(String("<b>Key</b>"),        String("<b>Value</b>"),                  String("<b>Current Value</b>"),             String("<b>Description</b>"));
  webpageTableAppend4Cols(String("discover"),          String("1"),                             String("1"),                                String("Trigger discovery of entities via MQTT"));
  webpageTableAppend4Cols(String("undiscover"),        String("1"),                             String("1"),                                String("Trigger undiscover of entities via MQTT"));
  webpageTableAppend4Cols(String("name"),              String("string"),                        String(myConfig.name),                      String("Define a name for this device"));
  webpageTableAppend4Cols(String("updServer"),         String("url"),                           String(myConfig.updServer),                 String("Address of the update server"));
  webpage +="</table>";
  /* Restart Device */
  webpage +="<p><b>Restart Device</b></p>";
  if (systemRestartRequest == false) {
    webpage +="<button onclick=\"window.location.href='/restart'\"> Restart </button>";
  } else {
    webpage +="<button onclick=\"window.location.href='/'\"> Restarting, reload site </button>";
  }
  webpage +="</body>\n";
  webpage +="</html>\n";

  webServer.send(200, "text/html", webpage);  /* Send a response to the client asking for input */

  /* Evaluate Received Arguments */
  if (webServer.args() > 0) {  /* Arguments were received */
    for ( uint8_t i = 0; i < webServer.args(); i++ ) {
      #ifdef CFG_DEBUG
      Serial.println("HTTP arg(" + String(i) + "): " + webServer.argName(i) + " = " + webServer.arg(i));  /* Display each argument */
      #endif /* CFG_DEBUG */
      if (webServer.argName(i) == "cmd") {  /* check for cmd */
        String key = "";
        String value = "";
        if (splitHtmlCommand(webServer.arg(i), &key, &value)) {
          Serial.println(key + " : " + value);
          if (key == "undiscover") {
            if (value.toInt() == 1) {
              myMqttHelper.setTriggerUndiscover(true);
            }
          } else if (key == "discover") {
            if (value.toInt() == 1) {
              myMqttHelper.setTriggerDiscovery(true);
            }
          }
        } else if (key == "name") {
            if ( (value != "") && (value != myConfig.name) ) {
              #ifdef CFG_DEBUG
              Serial.println("Request SPIFFS write with restart.");
              #endif
              strlcpy(myConfig.name, webServer.arg(i).c_str(), sizeof(myConfig.name));
              requestSaveToSpiffsWithRestart = true;
            } else {
              #ifdef CFG_DEBUG
              Serial.println("Configuration unchanged, do nothing");
              #endif
            }
          } else if (key == "updServer") {
            if ( (value != "") && (value != myConfig.updServer) ) {
              #ifdef CFG_DEBUG
              Serial.println("Request SPIFFS write.");
              #endif
              strlcpy(myConfig.updServer, webServer.arg(i).c_str(), sizeof(myConfig.updServer));
              requestSaveToSpiffs = true;
            } else {
              #ifdef CFG_DEBUG
              Serial.println("Configuration unchanged, do nothing");
              #endif
            }
          }
      }
      if (webServer.argName(i) == "InputMethod") {  /* check for dedicated arguments */
        if (webServer.arg(i) != String(myConfig.inputMethod) && (webServer.arg(i).toInt() >= 0) && (webServer.arg(i).toInt() < 2)) { /* check range and if changed at all */
          #ifdef CFG_DEBUG
          Serial.println("Request SPIFFS write with restart.");
          #endif
          myConfig.inputMethod = boolean(webServer.arg(i).toInt());
          requestSaveToSpiffsWithRestart = true;
        } else {
          #ifdef CFG_DEBUG
          Serial.println("Configuration unchanged, do nothing");
          #endif
        }
      }
      if (webServer.argName(i) == "Sensor") {  /* check for dedicated arguments */
        if (webServer.arg(i) != String(myConfig.sensor) && (webServer.arg(i).toInt() >= 0) && (webServer.arg(i).toInt() < 2)) { /* check range and if changed at all */
          #ifdef CFG_DEBUG
          Serial.println("Request SPIFFS write with restart.");
          #endif
          myConfig.sensor = webServer.arg(i).toInt();
          requestSaveToSpiffsWithRestart = true;
        } else {
          #ifdef CFG_DEBUG
          Serial.println("Configuration unchanged, do nothing");
          #endif
        }
      }
      if (webServer.argName(i) == "dispBrightn") {  /* check for dedicated arguments */
        if (webServer.arg(i).toInt() != myConfig.dispBrightn) {
          #ifdef CFG_DEBUG
          Serial.println("Request SPIFFS write.");
          #endif
          myConfig.dispBrightn = uint8_t(webServer.arg(i).toInt());
          requestSaveToSpiffsWithRestart = true;
        } else {
          #ifdef CFG_DEBUG
          Serial.println("Configuration unchanged, do nothing");
          #endif
        }
      }
      if (webServer.argName(i) == "calibF") {  /* check for dedicated arguments */
        if (webServer.arg(i).toInt() != myConfig.calibF) {
          #ifdef CFG_DEBUG
          Serial.println("Request SPIFFS write.");
          #endif
          myConfig.calibF = int16_t(webServer.arg(i).toInt());
          requestSaveToSpiffs = true;
        } else {
          #ifdef CFG_DEBUG
          Serial.println("Configuration unchanged, do nothing");
          #endif
        }
      }
      if (webServer.argName(i) == "calibO") {  /* check for dedicated arguments */
        if (webServer.arg(i).toInt() != myConfig.calibO) {
          #ifdef CFG_DEBUG
          Serial.println("Request SPIFFS write.");
          #endif
          myConfig.calibO = int16_t(webServer.arg(i).toInt());
          requestSaveToSpiffs = true;
        } else {
          #ifdef CFG_DEBUG
          Serial.println("Configuration unchanged, do nothing");
          #endif
        }
      }
    }
  }
}

void handleHttpReset(void) {
  systemRestartRequest = true;
  handleWebServerClient();
}

/* MQTT callback if a message was received */
void messageReceived(String &topic, String &payload) { //NOLINT
  #ifdef CFG_DEBUG
  Serial.println("received: " + topic + " : " + payload);
  #endif

